# GetUnderlayBaseLevel Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewPlan..::..GetUnderlayBaseLevel Method
ViewPlan Class See Also
---
Returns the element id of the level that defines the bottom of the underlay range.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ElementId GetUnderlayBaseLevel()
```

Visual Basic
---
```text
Public Function GetUnderlayBaseLevel As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetUnderlayBaseLevel()
```

# ### Return Value
If InvalidElementId is returned, then the underlay base level is not set and no elements will be displayed as underlay.
# See Also
ViewPlan Class
Autodesk.Revit.DB Namespace